; domain
(define (domain evolve_vulpix)
  (:requirements :strips :typing)
  (:types stone vulpix bag)
  
  (:predicates
    (has_vulpix ?vulpix)
    (found_fire_stone ?stone)
    (selected_stone ?stone)
    (selected_bag ?bag)
    (vulpix_evolved ?vulpix)
  )

  (:action catch_or_trade_vulpix
    :parameters (?vulpix)
    :precondition (not (has_vulpix ?vulpix))
    :effect (has_vulpix ?vulpix)
  )
  
  (:action find_fire_stone
    :parameters (?stone)
    :precondition (not (found_fire_stone ?stone))
    :effect (found_fire_stone ?stone)
  )

  (:action select_stone
    :parameters (?stone)
    :precondition (and (found_fire_stone ?stone) (not (selected_stone ?stone)))
    :effect (selected_stone ?stone)
  )

  (:action select_bag
    :parameters (?bag)
    :precondition (not (selected_bag ?bag))
    :effect (selected_bag ?bag)
  )

  (:action wait_for_evolution
    :parameters (?vulpix)
    :precondition (and (has_vulpix ?vulpix) (selected_stone stone) (selected_bag bag))
    :effect (vulpix_evolved ?vulpix)
  )
)

; problem
(define (problem evolve_vulpix_problem)
  (:domain evolve_vulpix)

  (:objects
    stone - stone
    vulpix - vulpix
    bag - bag
  )

  (:init
    (not (has_vulpix vulpix))
    (not (found_fire_stone stone))
    (not (selected_stone stone))
    (not (selected_bag bag))
  )

  (:goal
    (and (vulpix_evolved vulpix))
  )
)

; plan
1. (find_fire_stone stone)
   added: (found_fire_stone stone)
   goals met: 0 of 1
2. (select_bag bag)
   added: (selected_bag bag)
   goals met: 0 of 1
3. (catch_or_trade_vulpix vulpix)
   added: (has_vulpix vulpix)
   goals met: 0 of 1
4. (select_stone stone)
   added: (selected_stone stone)
   goals met: 0 of 1
5. (wait_for_evolution vulpix)
   added: (vulpix_evolved vulpix)
   goals met: 1 of 1
